{"2022/are-we-writing-good-tests":{"title":"Are we writing good tests?","links":[],"tags":["tests","tdd","acceptance-tests","rant"],"content":"In the past few years I became more and more addicted by tests. In the first stage of this disease I remember try to test every single happy and unhappy path of a flow, reach 100% code coverage, running tests against real databases and so on. For sure, it is not ideal and I totally understand the reason today.\nAlthough I was very excited with writing tests and see all the “passes” in the CI, I have not stopped to search for more resources and examples, and one day I came across an article about TDD. I don’t recall the exact article and it was not the first time I heard about the topic but that time I was bite.\n\nI finally landed at a company with everything in place: large code base extensively tested, unit, e2e, integration tests and all sort of those running in the CI for every PR, a dream for my old myself\n\nAt that point I was not ready to put TDD in practice, or at least I thought I wasn’t, so my journey increasing test coverage and writing as much tests I can to cover edge cases have continued, specially in two occasions where I was leading teams and pushed so hard in that direction. The time goes on and I finally landed at a company with everything in place: large code base extensively tested, unit, e2e, integration tests and all sort of those running in the CI for every PR, a dream for my old myself.\nIt’s not hard to foresee how a large code base, with hundred of developers individually testing each component becomes hard to maintain. Every single change requires fixes in many tests and this started to bother me. Specially in cases where you are working in a new feature, it’s supposed you don’t need to fix old tests since you are not breaking existing behavior, but this is not what happens in fact.\nI came across TDD again, quickly I noticed that we were writing bad tests, tests too tightly coupled to the implementation instead to the behavior. It was not uncommon to have 3 or 4 layers of mocks when writing tests, and now I know that this is result of a bad design, a design without tests in mind, which results in bad components very tangled, in fact it is not a problem with tests but with bad production code.\n\nwe were writing bad tests, tests too tightly coupled to the implementation instead to the behavior […] in fact it is not a problem with tests but with bad production code\n\nDoes TDD lead to good design? Yes, it does. It certainly does because it’s impossible to write tangled code, coupled components when you start with tests, and it is due to a simple premisse, we do not write production code hard to test when starting from tests.\nIt’s just a rant for sure, but I feel like my journey through the Acceptance Tests and TDD is just starting, and to be honest I’m very excited with all of this 😅\nReferences:\n\n\nContinuous Delivery — Awesome channel by Dave Farley;\n\n\nDoes TDD really lead to good design;\n\n\nToo many others to mention, hopefully I can come back here to do it in follow up rants.\n\n"},"index":{"title":"Welcome to some random thoughts","links":[],"tags":[],"content":"This is my personal collection of posts around software engineering and my career in the\ntech industry. I hope you somehow enjoy the content.\nThe articles here were published on medium previously and then migrated to this due to my personal\nissues with the platform paywall that although was not enabled on my posts is disgusting and\nmakes me skip any google result for medium."}}